Tekla Open API Reference for Tekla Structures 2025
Vector.GetAngleBetween Method
 Gets the angle (in radians) between the current vector and the given vector.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double GetAngleBetween(
	Vector Vector
)
Public Function GetAngleBetween (
	Vector As Vector
) As Double
Parameters
Vector
Type: Tekla.Structures.Geometry3d.Vector
The vector to be used.
Return Value
Type: Double
The angle between the vectors in radians.
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace